#+PROPERTY: header-args:python :exports both :results output replace
#+PROPERTY: header-args:sql :results value html

#+NAME: attr_wrap
#+BEGIN_SRC python :var data="" :results silent :exports none
import xml.etree.ElementTree as ET

def build_row(parent, data, tag):
    child = ET.SubElement(parent, "tr")
    for s in data.split("\t"):
        ET.SubElement(child, tag).text = s
    return child
# XML
data = data.split("\n")
table = ET.Element("table")
build_row(table, data[0], "th")
for row in data[1:-1]:
    build_row(table, row, "td")
ET.dump(table)
#+END_SRC


#+begin_src sql :post attr_wrap(data=*this*)
SELECT *
FROM departments
LIMIT 3;
#+end_src

#+RESULTS:
#+begin_export html
<table><tr><th>dept_no</th><th>dept_name</th></tr><tr><td>d001</td><td>Marketing</td></tr><tr><td>d002</td><td>Finance</td></tr><tr><td>d003</td><td>Human Resources</td></tr></table>
#+end_export
